# Height

## Description
Returns the height of an object. If more than one object matches the search criteria, the function will return the sum of all the matching object heights.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION Height(c : CRITERIA) : REAL;
```

```python

def vs.Height(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Examples
```pascal
HeightValue:=Height(N='North Wall');
```

## Version
Availability: from MiniCAD
## Category
* Criteria